app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["title", "Example Title"], ["description", "Example Description"], ["created_at", "2024-10-22 21:27:22.553714"], ["updated_at", "2024-10-22 21:27:22.553714"]]
---
    def create
        @article = Article.new(article_params)
        # @article.user = current_user
        if @article.save

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "Updated Title"], ["description", "Updated Description"], ["updated_at", "2024-10-22 21:27:22.763230"], ["id", 1]]
---
    def update
        if @article.update(article_params)